In [1]:
import pandas as pd
import numpy as np

In [2]:
visa = pd.read_csv("data/visa.csv", index_col = 0)

visa.groupby("citizenship")["decision"].value_counts()

citizenship  decision
AFGHANISTAN  Y            3
             N            1
ALBANIA      Y           10
             N            2
ALGERIA      N            2
                         ..
YUGOSLAVIA   N            1
ZAMBIA       Y            3
             N            1
ZIMBABWE     Y           16
             N            1
Name: decision, Length: 277, dtype: int64

In [184]:
(visa["citizenship"].value_counts() / len(visa)).head(9).index

Index(['INDIA', 'CHINA', 'CANADA', 'SOUTH KOREA', 'PHILIPPINES', 'MEXICO',
       'UNITED KINGDOM', 'TAIWAN', 'PAKISTAN'],
      dtype='object')

In [185]:
visa.loc[~visa["citizenship"].isin(['INDIA', 'CHINA', 'CANADA', 'SOUTH KOREA', 'PHILIPPINES', 'MEXICO',
       'UNITED KINGDOM', 'TAIWAN', 'PAKISTAN']),"citizenship"] = "Other"

In [193]:
len(visa)

38591

In [192]:
countries = (visa["citizenship"].value_counts())
countries.to_json(orient="records")

'[23216,6669,2127,1633,1606,1056,834,536,473,441]'

In [191]:
countries.index

Index(['INDIA', 'Other', 'CHINA', 'CANADA', 'SOUTH KOREA', 'PHILIPPINES',
       'MEXICO', 'UNITED KINGDOM', 'TAIWAN', 'PAKISTAN'],
      dtype='object')

In [182]:
len(visa)

38591

In [3]:
visa.head()

       category  citizenship application type visa class decision
0    Automotive      ECUADOR         MAILEDIN        EWI        Y
1  Advanced Mfg        INDIA           ONLINE       H-1B        Y
2  Advanced Mfg  PHILIPPINES           ONLINE        L-1        Y
3  Advanced Mfg        INDIA           ONLINE       H-1B        Y
4  Advanced Mfg        INDIA           ONLINE       H-1B        Y

In [4]:
visa["visa class"].unique()

array(['EWI', 'H-1B', 'L-1', 'E-2', 'TPS', 'B-2', 'B-1', 'F-1', 'H-2B',
       'VWT', 'Parolee', 'TN', 'Not in USA', 'H-4', 'F-2', 'E-3', 'O-1',
       'H-2A', 'H-1B1', 'E-1', 'G-5', 'A-3', 'A1/A2', 'H-3', 'P-1', 'C-1',
       'L-2', 'VWB', 'J-1', 'O-3', 'O-2', 'J-2', 'G-4', 'H-1A', 'R-1',
       'I', 'H1B', 'N', 'T-1', 'TD', 'Parol', 'AOS/H-1B', 'M-1', 'P-3',
       'K-1'], dtype=object)

- H-1B: work visa for professionals working in US
- L-1: work visa for foreiners opening business in US
- F-1: student visa
- Parolee: a permit for non-US national who does not have valid immigrant visa, but need to reenter

In [70]:
((visa["visa class"].value_counts() / len(visa)).head(4)).to_json()

'{"H-1B":0.85157161,"L-1":0.0362001503,"F-1":0.0284781426,"Parolee":0.0195382343}'

In [77]:
(((visa["visa class"].value_counts() / len(visa)).head(4))
 .reset_index()
 .rename(columns={"index":"name","visa class":"y"})
).to_json(orient="records")

'[{"name":"H-1B","y":0.85157161},{"name":"L-1","y":0.0362001503},{"name":"F-1","y":0.0284781426},{"name":"Parolee","y":0.0195382343}]'

In [80]:
1 - sum((visa["visa class"].value_counts() / len(visa)).head(4))

0.06421186286958092

In [88]:
(visa["visa class"].value_counts() / len(visa)).head(4).index

Index(['H-1B', 'L-1', 'F-1', 'Parolee'], dtype='object')

In [102]:
visa[visa["visa class"].isin(['H-1B', 'L-1', 'F-1', 'Parolee'])].head()

       category  citizenship application type visa class decision
1  Advanced Mfg        INDIA           ONLINE       H-1B        Y
2  Advanced Mfg  PHILIPPINES           ONLINE        L-1        Y
3  Advanced Mfg        INDIA           ONLINE       H-1B        Y
4  Advanced Mfg        INDIA           ONLINE       H-1B        Y
5  Advanced Mfg        INDIA           ONLINE       H-1B        Y

In [106]:
visa.loc[~visa["visa class"].isin(['H-1B', 'L-1', 'F-1', 'Parolee']),"visa class"] = "Other"

In [107]:
visa["visa class"].value_counts() / len(visa)

H-1B       0.851572
Other      0.064212
L-1        0.036200
F-1        0.028478
Parolee    0.019538
Name: visa class, dtype: float64

In [134]:
visa.groupby(["category", "visa class"])["decision"].value_counts().to_frame()

                                  decision
category     visa class decision
Advanced Mfg F-1        Y               75
                        N               23
             H-1B       Y             4385
                        N              711
             L-1        Y              274
...                                    ...
Retail       L-1        N                2
             Other      Y               86
                        N               46
             Parolee    Y               32
                        N                2

[87 rows x 1 columns]

In [137]:
(visa.groupby(["category", "visa class"])["decision"]
    .value_counts()
    .to_frame()
    .rename(columns={"decision":"count"}))

                                  count
category     visa class decision
Advanced Mfg F-1        Y            75
                        N            23
             H-1B       Y          4385
                        N           711
             L-1        Y           274
...                                 ...
Retail       L-1        N             2
             Other      Y            86
                        N            46
             Parolee    Y            32
                        N             2

[87 rows x 1 columns]

In [180]:
visa_class = (pd.pivot_table(
    (visa.groupby(["category", "visa class"])["decision"]
    .value_counts()
    .to_frame()
    .rename(columns={"decision":"count"})), 
    index=["visa class","category"], 
    columns=["decision"],
    values="count")
 .fillna(0)
).rename(columns={"N":"n", "Y":"y"})
visa_class["percent"] = visa_class["y"] / (visa_class["n"] + visa_class["y"])
visa_class["percent"]["F-1"].index
# (visa_class["percent"] * 100).to_json(orient="records")

Index(['Advanced Mfg', 'Educational Services', 'Finance', 'Health Care', 'IT',
       'Other', 'Other Economic Sector'],
      dtype='object', name='category')

In [175]:
visa_class["percent"].values

array([0.76530612, 0.80701754, 0.66666667, 0.76470588, 0.75581395,
       0.70253165, 0.6372549 , 0.86047881, 0.83310962, 0.89555284,
       0.86620531, 0.82879538, 0.88547318, 0.85566714, 0.86984127,
       1.        , 0.87931034, 1.        , 0.85294118, 0.92086331,
       0.82      , 0.74647887, 0.80314961, 0.825     , 0.59473684,
       0.76619718, 0.60966981, 0.64478114, 0.83870968, 1.        ,
       0.86956522, 0.81818182, 0.83555556, 0.89473684, 0.86075949])

In [7]:
visa.columns = visa.columns.str.lower()
visa.to_csv("./data/visa.csv")
visa.head()

       category  citizenship application type visa class decision
0    Automotive      ECUADOR         MAILEDIN        EWI        Y
1  Advanced Mfg        INDIA           ONLINE       H-1B        Y
2  Advanced Mfg  PHILIPPINES           ONLINE        L-1        Y
3  Advanced Mfg        INDIA           ONLINE       H-1B        Y
4  Advanced Mfg        INDIA           ONLINE       H-1B        Y

In [83]:
visa_decision = (pd.pivot_table(
    (visa.groupby("citizenship")["decision"]
    .value_counts()
    .to_frame()
    .rename(columns={"decision":"count"})), 
    index=["citizenship"], 
    columns=["decision"],
    values="count")
 .fillna(0)
).rename(columns={"N":"n", "Y":"y"})
visa_decision.head()

decision        n     y
citizenship
AFGHANISTAN   1.0   3.0
ALBANIA       2.0  10.0
ALGERIA       2.0   1.0
ARGENTINA    22.0  67.0
ARMENIA       0.0   9.0

In [10]:
visa_decision["percent"] = visa_decision["y"] / (visa_decision["n"] + visa_decision["y"])
# visa_decision.to_csv("data/visa_decision.csv")
visa_decision

decision        n     y   percent
citizenship
AFGHANISTAN   1.0   3.0  0.750000
ALBANIA       2.0  10.0  0.833333
ALGERIA       2.0   1.0  0.333333
ARGENTINA    22.0  67.0  0.752809
ARMENIA       0.0   9.0  1.000000
...           ...   ...       ...
VIETNAM       9.0  55.0  0.859375
YEMEN         0.0   3.0  1.000000
YUGOSLAVIA    1.0   2.0  0.666667
ZAMBIA        1.0   3.0  0.750000
ZIMBABWE      1.0  16.0  0.941176

[161 rows x 3 columns]

In [61]:
visa["decision"].value_counts() / len(visa)

Y    0.835195
N    0.164805
Name: decision, dtype: float64

In [121]:
job_pro = (visa["category"].value_counts() / len(visa) * 100).to_frame()
job_pro.head(10).index

Index(['IT', 'Advanced Mfg', 'Other Economic Sector', 'Finance',
       'Educational Services', 'Health Care', 'Retail', 'Aerospace',
       'Hospitality', 'Automotive'],
      dtype='object')

In [164]:
visa.loc[~visa["category"].isin(['IT', 'Advanced Mfg', 'Other Economic Sector', 'Finance',
       'Educational Services', 'Health Care']),"category"] = "Other"
job_pro = (visa["category"].value_counts() / len(visa) * 100).to_frame()
job_pro

                        category
IT                     42.914151
Advanced Mfg           15.171931
Other                  11.761810
Other Economic Sector  11.562281
Finance                 6.957581
Educational Services    6.439325
Health Care             5.192921

In [177]:
job_pro.index

Index(['IT', 'Advanced Mfg', 'Other', 'Other Economic Sector', 'Finance',
       'Educational Services', 'Health Care'],
      dtype='object')

In [129]:
job_pro.to_json()

'{"category":{"IT":42.9141509678,"Advanced Mfg":15.1719312793,"Other Economic Sector":11.5622813609,"Finance":6.9575807831,"Educational Services":6.4393252313,"Other":5.4002228499,"Health Care":5.1929206292,"Retail":3.3168355316,"Aerospace":3.0447513669}}'

In [130]:
job_pro = job_pro.reset_index().rename(columns={"index":"name","category":"y"})
job_pro.head()

                    name          y
0                     IT  42.914151
1           Advanced Mfg  15.171931
2  Other Economic Sector  11.562281
3                Finance   6.957581
4   Educational Services   6.439325

In [131]:
job_pro.to_json(orient='records')

'[{"name":"IT","y":42.9141509678},{"name":"Advanced Mfg","y":15.1719312793},{"name":"Other Economic Sector","y":11.5622813609},{"name":"Finance","y":6.9575807831},{"name":"Educational Services","y":6.4393252313},{"name":"Other","y":5.4002228499},{"name":"Health Care","y":5.1929206292},{"name":"Retail","y":3.3168355316},{"name":"Aerospace","y":3.0447513669}]'

In [17]:
job_pro.to_csv("data/job_pro.csv", index=False)

In [13]:
pd.read_csv("data/visa_decision.csv")

    Unnamed: 0     N      Y   percent
0           af   1.0    3.0  0.750000
1           al   2.0   10.0  0.833333
2           dz   2.0    1.0  0.333333
3           ar  22.0   67.0  0.752809
4           am   0.0    9.0  1.000000
..         ...   ...    ...       ...
154         ve  43.0  219.0  0.835878
155         vn   9.0   55.0  0.859375
156         ye   0.0    3.0  1.000000
157         zm   1.0    3.0  0.750000
158         zw   1.0   16.0  0.941176

[159 rows x 4 columns]